---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightFamily.GetLightDistributionStyle
source: html/7641a016-f409-3468-beea-17c33923d396.htm
---
# Autodesk.Revit.DB.Lighting.LightFamily.GetLightDistributionStyle Method

Returns a LightDistributionStyle value for the light distribution

## Syntax (C#)
```csharp
public LightDistributionStyle GetLightDistributionStyle()
```